Revit 2027 API
EnergyAnalysisOpening.OriginatingElementDescription Property
 The description for the originating Revit element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OriginatingElementDescription { get; }
Public ReadOnly Property OriginatingElementDescription As String
	Get
public:
property String^ OriginatingElementDescription {
	String^ get ();
}
member OriginatingElementDescription : string with get
Property Value
String
Remarks
 Surface and Opening elements get an CADObjectId element assigned according to the below described schema, based on associative room bounding element:
(Family Name): (Family Type)[Element Id]
 Sample: System Panel: System Panel [50566]
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace